wsf_c/savanc/src/subs_mgrs/registry/test/httperf/results/savanc_get_status_1000_16_128
httperf --hog --timeout=60 --client=0/1 --server=10.100.1.44 --port=80 --uri=/axis2/services/weather --max-piped-calls=16 --rate=128 --send-buffer=4096 --recv-buffer=16384 --add-header='Content-type:application/soap+xml;charset=UTF-8\n' --method=POST --wsesslog=10000,0.000,savanc_temp
Maximum connect burst length: 8

Total: connections 10000 requests 10000 replies 10000 test-duration 78.129 s

Connection rate: 128.0 conn/s (7.8 ms/conn, <=547 concurrent connections)
Connection time [ms]: min 2.2 avg 554.9 max 21067.2 median 14.5 stddev 1617.9
Connection time [ms]: connect 272.2
Connection length [replies/conn]: 1.000

Request rate: 128.0 req/s (7.8 ms/req)
Request size [B]: 804.0

Reply rate [replies/s]: min 80.4 avg 127.8 max 190.4 stddev 22.3 (15 samples)
Reply time [ms]: response 282.8 transfer 0.0
Reply size [B]: header 155.0 content 709.0 footer 0.0 (total 864.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 6.62 system 67.73 (user 8.5% system 86.7% total 95.2%)
Net I/O: 208.5 KB/s (1.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

Session rate [sess/s]: min 80.35 avg 127.99 max 190.41 stddev 22.26 (10000/10000)
Session: avg 1.00 connections/session
Session lifetime [s]: 0.6
Session failtime [s]: 0.0
Session length histogram: 0 10000