wsf_c/savanc/src/subs_mgrs/registry/test/httperf/results/savanc_get_status_1000_16_256
httperf --hog --timeout=60 --client=0/1 --server=10.100.1.44 --port=80 --uri=/axis2/services/weather --max-piped-calls=16 --rate=256 --send-buffer=4096 --recv-buffer=16384 --add-header='Content-type:application/soap+xml;charset=UTF-8\n' --method=POST --wsesslog=10000,0.000,savanc_temp
Maximum connect burst length: 9

Total: connections 10000 requests 10000 replies 10000 test-duration 39.156 s

Connection rate: 255.4 conn/s (3.9 ms/conn, <=385 concurrent connections)
Connection time [ms]: min 10.0 avg 851.5 max 4261.6 median 888.5 stddev 380.4
Connection time [ms]: connect 390.9
Connection length [replies/conn]: 1.000

Request rate: 255.4 req/s (3.9 ms/req)
Request size [B]: 804.0

Reply rate [replies/s]: min 221.0 avg 250.8 max 281.2 stddev 24.7 (7 samples)
Reply time [ms]: response 460.6 transfer 0.0
Reply size [B]: header 155.0 content 709.0 footer 0.0 (total 864.0)
Reply status: 1xx=0 2xx=10000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.10 system 37.04 (user 2.8% system 94.6% total 97.4%)
Net I/O: 416.0 KB/s (3.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

Session rate [sess/s]: min 221.02 avg 255.39 max 281.22 stddev 24.68 (10000/10000)
Session: avg 1.00 connections/session
Session lifetime [s]: 0.9
Session failtime [s]: 0.0
Session length histogram: 0 10000